---
kind: other
id: Events.T:Autodesk.Revit.ApplicationServices.ControlledApplication
source: html/fa23dcb9-fd52-b8ac-eec4-7ce03eac4b7d.htm
---
# ControlledApplication Events

Subscribe to this event to get notified after the Revit application has been initialized